{"class_name": "Model", "keras_version": "2.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 48, 48, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "block1_conv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv1_act"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "name": "block1_conv1_act"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "block1_conv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv2_act"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv2d_1"}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "separable_conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2_sepconv2_act"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv2d_2"}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "name": "separable_conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv2_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv1_act"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv2d_3"}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "name": "separable_conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv2_act"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv2d_4"}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "name": "separable_conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv2_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "global_average_pooling2d_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "predictions"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "predictions"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}